[Killed] BlockStatement
src/Yatzy.ts:4:75
 export default class Yatzy {
   private dice: number[];
 
-  constructor(d1: number, d2: number, d3: number, d4: number, _5: number) {
-    this.dice = [];
-    this.dice[0] = d1;
-    this.dice[1] = d2;
-    this.dice[2] = d3;
-    this.dice[3] = d4;
-    this.dice[4] = _5;
-  }
+  constructor(d1: number, d2: number, d3: number, d4: number, _5: number) {}
 
   static chance(d1: number, d2: number, d3: number, d4: number, d5: number): number {
killedBy: All tests
statusReason: > yatzy-refactoring-kata@0.0.1 test
> jest


FAIL src/Yatzy.spec.ts (9.081 s)

  Given a Yatzy game

[Timeout] BlockStatement
src/Yatzy.ts:13:85
     this.dice[4] = _5;
   }
 
-  static chance(d1: number, d2: number, d3: number, d4: number, d5: number): number {
-    var total = 0;
-    total += d1;
-    total += d2;
-    total += d3;
-    total += d4;
-    total += d5;
-    return total;
-  }
+  static chance(d1: number, d2: number, d3: number, d4: number, d5: number): number {}
 
   static yatzy(...args: number[]): number {

[Timeout] AssignmentOperator
src/Yatzy.ts:15:5
 
   static chance(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var total = 0;
-    total += d1;
+    total -= d1;
     total += d2;
     total += d3;

[Timeout] AssignmentOperator
src/Yatzy.ts:16:5
   static chance(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var total = 0;
     total += d1;
-    total += d2;
+    total -= d2;
     total += d3;
     total += d4;

[Timeout] AssignmentOperator
src/Yatzy.ts:17:5
     var total = 0;
     total += d1;
     total += d2;
-    total += d3;
+    total -= d3;
     total += d4;
     total += d5;

[Timeout] AssignmentOperator
src/Yatzy.ts:18:5
     total += d1;
     total += d2;
     total += d3;
-    total += d4;
+    total -= d4;
     total += d5;
     return total;

[Timeout] AssignmentOperator
src/Yatzy.ts:19:5
     total += d2;
     total += d3;
     total += d4;
-    total += d5;
+    total -= d5;
     return total;
   }

[Timeout] BlockStatement
src/Yatzy.ts:23:43
     return total;
   }
 
-  static yatzy(...args: number[]): number {
-    var counts = [0, 0, 0, 0, 0, 0, 0, 0];
-    for (var i = 0; i != args.length; ++i) {
-      var die = args[i];
-      counts[die - 1]++;
-    }
-    for (i = 0; i != 6; i++) if (counts[i] == 5) return 50;
-    return 0;
-  }
+  static yatzy(...args: number[]): number {}
 
   static ones(d1: number, d2: number, d3: number, d4: number, d5: number): number {

[Timeout] UpdateOperator
src/Yatzy.ts:25:39
 
   static yatzy(...args: number[]): number {
     var counts = [0, 0, 0, 0, 0, 0, 0, 0];
-    for (var i = 0; i != args.length; ++i) {
+    for (var i = 0; i != args.length; --i) {
       var die = args[i];
       counts[die - 1]++;

[Timeout] ConditionalExpression
src/Yatzy.ts:25:21
 
   static yatzy(...args: number[]): number {
     var counts = [0, 0, 0, 0, 0, 0, 0, 0];
-    for (var i = 0; i != args.length; ++i) {
+    for (var i = 0; false; ++i) {
       var die = args[i];
       counts[die - 1]++;

[Timeout] ArithmeticOperator
src/Yatzy.ts:27:14
     var counts = [0, 0, 0, 0, 0, 0, 0, 0];
     for (var i = 0; i != args.length; ++i) {
       var die = args[i];
-      counts[die - 1]++;
+      counts[die + 1]++;
     }
     for (i = 0; i != 6; i++) if (counts[i] == 5) return 50;

[Timeout] UpdateOperator
src/Yatzy.ts:27:7
     var counts = [0, 0, 0, 0, 0, 0, 0, 0];
     for (var i = 0; i != args.length; ++i) {
       var die = args[i];
-      counts[die - 1]++;
+      counts[die - 1]--;
     }
     for (i = 0; i != 6; i++) if (counts[i] == 5) return 50;

[Timeout] UpdateOperator
src/Yatzy.ts:29:25
       var die = args[i];
       counts[die - 1]++;
     }
-    for (i = 0; i != 6; i++) if (counts[i] == 5) return 50;
+    for (i = 0; i != 6; i--) if (counts[i] == 5) return 50;
     return 0;
   }

[Timeout] ConditionalExpression
src/Yatzy.ts:29:34
       var die = args[i];
       counts[die - 1]++;
     }
-    for (i = 0; i != 6; i++) if (counts[i] == 5) return 50;
+    for (i = 0; i != 6; i++) if (true) return 50;
     return 0;
   }

[Timeout] BlockStatement
src/Yatzy.ts:33:83
     return 0;
   }
 
-  static ones(d1: number, d2: number, d3: number, d4: number, d5: number): number {
-    var sum = 0;
-    if (d1 == 1) sum++;
-    if (d2 == 1) sum++;
-    if (d3 == 1) sum++;
-    if (d4 == 1) sum++;
-    if (d5 == 1) sum++;
-
-    return sum;
-  }
+  static ones(d1: number, d2: number, d3: number, d4: number, d5: number): number {}
 
   static twos(d1: number, d2: number, d3: number, d4: number, d5: number): number {

[Timeout] ConditionalExpression
src/Yatzy.ts:35:9
 
   static ones(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var sum = 0;
-    if (d1 == 1) sum++;
+    if (true) sum++;
     if (d2 == 1) sum++;
     if (d3 == 1) sum++;

[Timeout] ConditionalExpression
src/Yatzy.ts:35:9
 
   static ones(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var sum = 0;
-    if (d1 == 1) sum++;
+    if (false) sum++;
     if (d2 == 1) sum++;
     if (d3 == 1) sum++;

[Timeout] ConditionalExpression
src/Yatzy.ts:36:9
   static ones(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var sum = 0;
     if (d1 == 1) sum++;
-    if (d2 == 1) sum++;
+    if (true) sum++;
     if (d3 == 1) sum++;
     if (d4 == 1) sum++;

[Timeout] ConditionalExpression
src/Yatzy.ts:36:9
   static ones(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var sum = 0;
     if (d1 == 1) sum++;
-    if (d2 == 1) sum++;
+    if (false) sum++;
     if (d3 == 1) sum++;
     if (d4 == 1) sum++;

[Timeout] UpdateOperator
src/Yatzy.ts:37:18
     var sum = 0;
     if (d1 == 1) sum++;
     if (d2 == 1) sum++;
-    if (d3 == 1) sum++;
+    if (d3 == 1) sum--;
     if (d4 == 1) sum++;
     if (d5 == 1) sum++;

[Timeout] EqualityOperator
src/Yatzy.ts:37:9
     var sum = 0;
     if (d1 == 1) sum++;
     if (d2 == 1) sum++;
-    if (d3 == 1) sum++;
+    if (d3 != 1) sum++;
     if (d4 == 1) sum++;
     if (d5 == 1) sum++;

[Timeout] ConditionalExpression
src/Yatzy.ts:38:9
     if (d1 == 1) sum++;
     if (d2 == 1) sum++;
     if (d3 == 1) sum++;
-    if (d4 == 1) sum++;
+    if (true) sum++;
     if (d5 == 1) sum++;
 

[Timeout] EqualityOperator
src/Yatzy.ts:38:9
     if (d1 == 1) sum++;
     if (d2 == 1) sum++;
     if (d3 == 1) sum++;
-    if (d4 == 1) sum++;
+    if (d4 != 1) sum++;
     if (d5 == 1) sum++;
 

[Timeout] EqualityOperator
src/Yatzy.ts:39:9
     if (d2 == 1) sum++;
     if (d3 == 1) sum++;
     if (d4 == 1) sum++;
-    if (d5 == 1) sum++;
+    if (d5 != 1) sum++;
 
     return sum;

[Timeout] ConditionalExpression
src/Yatzy.ts:39:9
     if (d2 == 1) sum++;
     if (d3 == 1) sum++;
     if (d4 == 1) sum++;
-    if (d5 == 1) sum++;
+    if (true) sum++;
 
     return sum;

[Timeout] BlockStatement
src/Yatzy.ts:44:83
     return sum;
   }
 
-  static twos(d1: number, d2: number, d3: number, d4: number, d5: number): number {
-    var sum = 0;
-    if (d1 == 2) sum += 2;
-    if (d2 == 2) sum += 2;
-    if (d3 == 2) sum += 2;
-    if (d4 == 2) sum += 2;
-    if (d5 == 2) sum += 2;
-    return sum;
-  }
+  static twos(d1: number, d2: number, d3: number, d4: number, d5: number): number {}
 
   static threes(d1: number, d2: number, d3: number, d4: number, d5: number): number {

[Timeout] ConditionalExpression
src/Yatzy.ts:46:9
 
   static twos(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var sum = 0;
-    if (d1 == 2) sum += 2;
+    if (true) sum += 2;
     if (d2 == 2) sum += 2;
     if (d3 == 2) sum += 2;

[Timeout] EqualityOperator
src/Yatzy.ts:46:9
 
   static twos(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var sum = 0;
-    if (d1 == 2) sum += 2;
+    if (d1 != 2) sum += 2;
     if (d2 == 2) sum += 2;
     if (d3 == 2) sum += 2;

[Timeout] ConditionalExpression
src/Yatzy.ts:47:9
   static twos(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var sum = 0;
     if (d1 == 2) sum += 2;
-    if (d2 == 2) sum += 2;
+    if (false) sum += 2;
     if (d3 == 2) sum += 2;
     if (d4 == 2) sum += 2;

[Timeout] AssignmentOperator
src/Yatzy.ts:47:18
   static twos(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var sum = 0;
     if (d1 == 2) sum += 2;
-    if (d2 == 2) sum += 2;
+    if (d2 == 2) sum -= 2;
     if (d3 == 2) sum += 2;
     if (d4 == 2) sum += 2;

[Timeout] AssignmentOperator
src/Yatzy.ts:48:18
     var sum = 0;
     if (d1 == 2) sum += 2;
     if (d2 == 2) sum += 2;
-    if (d3 == 2) sum += 2;
+    if (d3 == 2) sum -= 2;
     if (d4 == 2) sum += 2;
     if (d5 == 2) sum += 2;

[Timeout] EqualityOperator
src/Yatzy.ts:48:9
     var sum = 0;
     if (d1 == 2) sum += 2;
     if (d2 == 2) sum += 2;
-    if (d3 == 2) sum += 2;
+    if (d3 != 2) sum += 2;
     if (d4 == 2) sum += 2;
     if (d5 == 2) sum += 2;

[Timeout] ConditionalExpression
src/Yatzy.ts:49:9
     if (d1 == 2) sum += 2;
     if (d2 == 2) sum += 2;
     if (d3 == 2) sum += 2;
-    if (d4 == 2) sum += 2;
+    if (true) sum += 2;
     if (d5 == 2) sum += 2;
     return sum;

[Timeout] EqualityOperator
src/Yatzy.ts:49:9
     if (d1 == 2) sum += 2;
     if (d2 == 2) sum += 2;
     if (d3 == 2) sum += 2;
-    if (d4 == 2) sum += 2;
+    if (d4 != 2) sum += 2;
     if (d5 == 2) sum += 2;
     return sum;

[Timeout] AssignmentOperator
src/Yatzy.ts:50:18
     if (d2 == 2) sum += 2;
     if (d3 == 2) sum += 2;
     if (d4 == 2) sum += 2;
-    if (d5 == 2) sum += 2;
+    if (d5 == 2) sum -= 2;
     return sum;
   }

[Timeout] EqualityOperator
src/Yatzy.ts:50:9
     if (d2 == 2) sum += 2;
     if (d3 == 2) sum += 2;
     if (d4 == 2) sum += 2;
-    if (d5 == 2) sum += 2;
+    if (d5 != 2) sum += 2;
     return sum;
   }

[Timeout] BlockStatement
src/Yatzy.ts:54:85
     return sum;
   }
 
-  static threes(d1: number, d2: number, d3: number, d4: number, d5: number): number {
-    var s;
-    s = 0;
-    if (d1 == 3) s += 3;
-    if (d2 == 3) s += 3;
-    if (d3 == 3) s += 3;
-    if (d4 == 3) s += 3;
-    if (d5 == 3) s += 3;
-    return s;
-  }
+  static threes(d1: number, d2: number, d3: number, d4: number, d5: number): number {}
 
   static score_pair(d1: number, d2: number, d3: number, d4: number, d5: number): number {

[Timeout] EqualityOperator
src/Yatzy.ts:57:9
   static threes(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var s;
     s = 0;
-    if (d1 == 3) s += 3;
+    if (d1 != 3) s += 3;
     if (d2 == 3) s += 3;
     if (d3 == 3) s += 3;

[Timeout] AssignmentOperator
src/Yatzy.ts:57:18
   static threes(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var s;
     s = 0;
-    if (d1 == 3) s += 3;
+    if (d1 == 3) s -= 3;
     if (d2 == 3) s += 3;
     if (d3 == 3) s += 3;

[Timeout] ConditionalExpression
src/Yatzy.ts:58:9
     var s;
     s = 0;
     if (d1 == 3) s += 3;
-    if (d2 == 3) s += 3;
+    if (false) s += 3;
     if (d3 == 3) s += 3;
     if (d4 == 3) s += 3;

[Timeout] AssignmentOperator
src/Yatzy.ts:58:18
     var s;
     s = 0;
     if (d1 == 3) s += 3;
-    if (d2 == 3) s += 3;
+    if (d2 == 3) s -= 3;
     if (d3 == 3) s += 3;
     if (d4 == 3) s += 3;

[Timeout] AssignmentOperator
src/Yatzy.ts:59:18
     s = 0;
     if (d1 == 3) s += 3;
     if (d2 == 3) s += 3;
-    if (d3 == 3) s += 3;
+    if (d3 == 3) s -= 3;
     if (d4 == 3) s += 3;
     if (d5 == 3) s += 3;

[Timeout] ConditionalExpression
src/Yatzy.ts:59:9
     s = 0;
     if (d1 == 3) s += 3;
     if (d2 == 3) s += 3;
-    if (d3 == 3) s += 3;
+    if (false) s += 3;
     if (d4 == 3) s += 3;
     if (d5 == 3) s += 3;

[Timeout] ConditionalExpression
src/Yatzy.ts:60:9
     if (d1 == 3) s += 3;
     if (d2 == 3) s += 3;
     if (d3 == 3) s += 3;
-    if (d4 == 3) s += 3;
+    if (true) s += 3;
     if (d5 == 3) s += 3;
     return s;

[Timeout] EqualityOperator
src/Yatzy.ts:60:9
     if (d1 == 3) s += 3;
     if (d2 == 3) s += 3;
     if (d3 == 3) s += 3;
-    if (d4 == 3) s += 3;
+    if (d4 != 3) s += 3;
     if (d5 == 3) s += 3;
     return s;

[Timeout] ConditionalExpression
src/Yatzy.ts:61:9
     if (d2 == 3) s += 3;
     if (d3 == 3) s += 3;
     if (d4 == 3) s += 3;
-    if (d5 == 3) s += 3;
+    if (false) s += 3;
     return s;
   }

[Timeout] ConditionalExpression
src/Yatzy.ts:61:9
     if (d2 == 3) s += 3;
     if (d3 == 3) s += 3;
     if (d4 == 3) s += 3;
-    if (d5 == 3) s += 3;
+    if (true) s += 3;
     return s;
   }

[Timeout] BlockStatement
src/Yatzy.ts:65:89
     return s;
   }
 
-  static score_pair(d1: number, d2: number, d3: number, d4: number, d5: number): number {
-    var counts = [0, 0, 0, 0, 0, 0, 0, 0, 0];
-    counts[d1 - 1]++;
-    counts[d2 - 1]++;
-    counts[d3 - 1]++;
-    counts[d4 - 1]++;
-    counts[d5 - 1]++;
-    var at;
-    for (at = 0; at != 6; at++) if (counts[6 - at - 1] >= 2) return (6 - at) * 2;
-    return 0;
-  }
+  static score_pair(d1: number, d2: number, d3: number, d4: number, d5: number): number {}
 
   static two_pair(d1: number, d2: number, d3: number, d4: number, d5: number): number {

[Timeout] ArithmeticOperator
src/Yatzy.ts:67:12
 
   static score_pair(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var counts = [0, 0, 0, 0, 0, 0, 0, 0, 0];
-    counts[d1 - 1]++;
+    counts[d1 + 1]++;
     counts[d2 - 1]++;
     counts[d3 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:67:5
 
   static score_pair(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var counts = [0, 0, 0, 0, 0, 0, 0, 0, 0];
-    counts[d1 - 1]++;
+    counts[d1 - 1]--;
     counts[d2 - 1]++;
     counts[d3 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:68:5
   static score_pair(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var counts = [0, 0, 0, 0, 0, 0, 0, 0, 0];
     counts[d1 - 1]++;
-    counts[d2 - 1]++;
+    counts[d2 - 1]--;
     counts[d3 - 1]++;
     counts[d4 - 1]++;

[Timeout] ArithmeticOperator
src/Yatzy.ts:68:12
   static score_pair(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var counts = [0, 0, 0, 0, 0, 0, 0, 0, 0];
     counts[d1 - 1]++;
-    counts[d2 - 1]++;
+    counts[d2 + 1]++;
     counts[d3 - 1]++;
     counts[d4 - 1]++;

[Timeout] ArithmeticOperator
src/Yatzy.ts:69:12
     var counts = [0, 0, 0, 0, 0, 0, 0, 0, 0];
     counts[d1 - 1]++;
     counts[d2 - 1]++;
-    counts[d3 - 1]++;
+    counts[d3 + 1]++;
     counts[d4 - 1]++;
     counts[d5 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:69:5
     var counts = [0, 0, 0, 0, 0, 0, 0, 0, 0];
     counts[d1 - 1]++;
     counts[d2 - 1]++;
-    counts[d3 - 1]++;
+    counts[d3 - 1]--;
     counts[d4 - 1]++;
     counts[d5 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:70:5
     counts[d1 - 1]++;
     counts[d2 - 1]++;
     counts[d3 - 1]++;
-    counts[d4 - 1]++;
+    counts[d4 - 1]--;
     counts[d5 - 1]++;
     var at;

[Timeout] ArithmeticOperator
src/Yatzy.ts:70:12
     counts[d1 - 1]++;
     counts[d2 - 1]++;
     counts[d3 - 1]++;
-    counts[d4 - 1]++;
+    counts[d4 + 1]++;
     counts[d5 - 1]++;
     var at;

[Timeout] ArithmeticOperator
src/Yatzy.ts:71:12
     counts[d2 - 1]++;
     counts[d3 - 1]++;
     counts[d4 - 1]++;
-    counts[d5 - 1]++;
+    counts[d5 + 1]++;
     var at;
     for (at = 0; at != 6; at++) if (counts[6 - at - 1] >= 2) return (6 - at) * 2;

[Timeout] UpdateOperator
src/Yatzy.ts:71:5
     counts[d2 - 1]++;
     counts[d3 - 1]++;
     counts[d4 - 1]++;
-    counts[d5 - 1]++;
+    counts[d5 - 1]--;
     var at;
     for (at = 0; at != 6; at++) if (counts[6 - at - 1] >= 2) return (6 - at) * 2;

[Timeout] ConditionalExpression
src/Yatzy.ts:73:18
     counts[d4 - 1]++;
     counts[d5 - 1]++;
     var at;
-    for (at = 0; at != 6; at++) if (counts[6 - at - 1] >= 2) return (6 - at) * 2;
+    for (at = 0; false; at++) if (counts[6 - at - 1] >= 2) return (6 - at) * 2;
     return 0;
   }

[Timeout] ArithmeticOperator
src/Yatzy.ts:73:44
     counts[d4 - 1]++;
     counts[d5 - 1]++;
     var at;
-    for (at = 0; at != 6; at++) if (counts[6 - at - 1] >= 2) return (6 - at) * 2;
+    for (at = 0; at != 6; at++) if (counts[6 - at + 1] >= 2) return (6 - at) * 2;
     return 0;
   }

[Timeout] BlockStatement
src/Yatzy.ts:77:87
     return 0;
   }
 
-  static two_pair(d1: number, d2: number, d3: number, d4: number, d5: number): number {
-    var counts = [0, 0, 0, 0, 0, 0, 0, 0, 0];
-    counts[d1 - 1]++;
-    counts[d2 - 1]++;
-    counts[d3 - 1]++;
-    counts[d4 - 1]++;
-    counts[d5 - 1]++;
-    var n = 0;
-    var score = 0;
-    for (let i = 0; i < 6; i += 1)
-      if (counts[6 - i - 1] >= 2) {
-        n++;
-        score += 6 - i;
-      }
-    if (n == 2) return score * 2;
-    else return 0;
-  }
+  static two_pair(d1: number, d2: number, d3: number, d4: number, d5: number): number {}
 
   static four_of_a_kind(_1: number, _2: number, d3: number, d4: number, d5: number): number {

[Timeout] EqualityOperator
src/Yatzy.ts:86:21
     counts[d5 - 1]++;
     var n = 0;
     var score = 0;
-    for (let i = 0; i < 6; i += 1)
+    for (let i = 0; i <= 6; i += 1)
       if (counts[6 - i - 1] >= 2) {
         n++;

[Timeout] EqualityOperator
src/Yatzy.ts:86:21
     counts[d5 - 1]++;
     var n = 0;
     var score = 0;
-    for (let i = 0; i < 6; i += 1)
+    for (let i = 0; i >= 6; i += 1)
       if (counts[6 - i - 1] >= 2) {
         n++;

[Timeout] ConditionalExpression
src/Yatzy.ts:87:11
     var n = 0;
     var score = 0;
     for (let i = 0; i < 6; i += 1)
-      if (counts[6 - i - 1] >= 2) {
+      if (false) {
         n++;
         score += 6 - i;

[Timeout] EqualityOperator
src/Yatzy.ts:87:11
     var n = 0;
     var score = 0;
     for (let i = 0; i < 6; i += 1)
-      if (counts[6 - i - 1] >= 2) {
+      if (counts[6 - i - 1] > 2) {
         n++;
         score += 6 - i;

[Timeout] UpdateOperator
src/Yatzy.ts:88:9
     var score = 0;
     for (let i = 0; i < 6; i += 1)
       if (counts[6 - i - 1] >= 2) {
-        n++;
+        n--;
         score += 6 - i;
       }

[Timeout] ArithmeticOperator
src/Yatzy.ts:89:18
     for (let i = 0; i < 6; i += 1)
       if (counts[6 - i - 1] >= 2) {
         n++;
-        score += 6 - i;
+        score += 6 + i;
       }
     if (n == 2) return score * 2;

[Timeout] AssignmentOperator
src/Yatzy.ts:89:9
     for (let i = 0; i < 6; i += 1)
       if (counts[6 - i - 1] >= 2) {
         n++;
-        score += 6 - i;
+        score -= 6 - i;
       }
     if (n == 2) return score * 2;

[Timeout] ArithmeticOperator
src/Yatzy.ts:91:24
         n++;
         score += 6 - i;
       }
-    if (n == 2) return score * 2;
+    if (n == 2) return score / 2;
     else return 0;
   }

[Timeout] ConditionalExpression
src/Yatzy.ts:91:9
         n++;
         score += 6 - i;
       }
-    if (n == 2) return score * 2;
+    if (false) return score * 2;
     else return 0;
   }

[Timeout] BlockStatement
src/Yatzy.ts:95:93
     else return 0;
   }
 
-  static four_of_a_kind(_1: number, _2: number, d3: number, d4: number, d5: number): number {
-    var tallies;
-    tallies = [0, 0, 0, 0, 0, 0, 0, 0];
-    tallies[_1 - 1]++;
-    tallies[_2 - 1]++;
-    tallies[d3 - 1]++;
-    tallies[d4 - 1]++;
-    tallies[d5 - 1]++;
-    for (let i = 0; i < 6; i++) if (tallies[i] >= 4) return (i + 1) * 4;
-    return 0;
-  }
+  static four_of_a_kind(_1: number, _2: number, d3: number, d4: number, d5: number): number {}
 
   static three_of_a_kind(d1: number, d2: number, d3: number, d4: number, d5: number): number {

[Timeout] ArrayDeclaration
src/Yatzy.ts:97:15
 
   static four_of_a_kind(_1: number, _2: number, d3: number, d4: number, d5: number): number {
     var tallies;
-    tallies = [0, 0, 0, 0, 0, 0, 0, 0];
+    tallies = [];
     tallies[_1 - 1]++;
     tallies[_2 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:98:5
   static four_of_a_kind(_1: number, _2: number, d3: number, d4: number, d5: number): number {
     var tallies;
     tallies = [0, 0, 0, 0, 0, 0, 0, 0];
-    tallies[_1 - 1]++;
+    tallies[_1 - 1]--;
     tallies[_2 - 1]++;
     tallies[d3 - 1]++;

[Timeout] ArithmeticOperator
src/Yatzy.ts:98:13
   static four_of_a_kind(_1: number, _2: number, d3: number, d4: number, d5: number): number {
     var tallies;
     tallies = [0, 0, 0, 0, 0, 0, 0, 0];
-    tallies[_1 - 1]++;
+    tallies[_1 + 1]++;
     tallies[_2 - 1]++;
     tallies[d3 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:99:5
     var tallies;
     tallies = [0, 0, 0, 0, 0, 0, 0, 0];
     tallies[_1 - 1]++;
-    tallies[_2 - 1]++;
+    tallies[_2 - 1]--;
     tallies[d3 - 1]++;
     tallies[d4 - 1]++;

[Timeout] ArithmeticOperator
src/Yatzy.ts:99:13
     var tallies;
     tallies = [0, 0, 0, 0, 0, 0, 0, 0];
     tallies[_1 - 1]++;
-    tallies[_2 - 1]++;
+    tallies[_2 + 1]++;
     tallies[d3 - 1]++;
     tallies[d4 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:100:5
     tallies = [0, 0, 0, 0, 0, 0, 0, 0];
     tallies[_1 - 1]++;
     tallies[_2 - 1]++;
-    tallies[d3 - 1]++;
+    tallies[d3 - 1]--;
     tallies[d4 - 1]++;
     tallies[d5 - 1]++;

[Timeout] ArithmeticOperator
src/Yatzy.ts:100:13
     tallies = [0, 0, 0, 0, 0, 0, 0, 0];
     tallies[_1 - 1]++;
     tallies[_2 - 1]++;
-    tallies[d3 - 1]++;
+    tallies[d3 + 1]++;
     tallies[d4 - 1]++;
     tallies[d5 - 1]++;

[Timeout] ArithmeticOperator
src/Yatzy.ts:101:13
     tallies[_1 - 1]++;
     tallies[_2 - 1]++;
     tallies[d3 - 1]++;
-    tallies[d4 - 1]++;
+    tallies[d4 + 1]++;
     tallies[d5 - 1]++;
     for (let i = 0; i < 6; i++) if (tallies[i] >= 4) return (i + 1) * 4;

[Timeout] UpdateOperator
src/Yatzy.ts:101:5
     tallies[_1 - 1]++;
     tallies[_2 - 1]++;
     tallies[d3 - 1]++;
-    tallies[d4 - 1]++;
+    tallies[d4 - 1]--;
     tallies[d5 - 1]++;
     for (let i = 0; i < 6; i++) if (tallies[i] >= 4) return (i + 1) * 4;

[Timeout] ArithmeticOperator
src/Yatzy.ts:102:13
     tallies[_2 - 1]++;
     tallies[d3 - 1]++;
     tallies[d4 - 1]++;
-    tallies[d5 - 1]++;
+    tallies[d5 + 1]++;
     for (let i = 0; i < 6; i++) if (tallies[i] >= 4) return (i + 1) * 4;
     return 0;

[Timeout] UpdateOperator
src/Yatzy.ts:102:5
     tallies[_2 - 1]++;
     tallies[d3 - 1]++;
     tallies[d4 - 1]++;
-    tallies[d5 - 1]++;
+    tallies[d5 - 1]--;
     for (let i = 0; i < 6; i++) if (tallies[i] >= 4) return (i + 1) * 4;
     return 0;

[Timeout] ConditionalExpression
src/Yatzy.ts:103:37
     tallies[d3 - 1]++;
     tallies[d4 - 1]++;
     tallies[d5 - 1]++;
-    for (let i = 0; i < 6; i++) if (tallies[i] >= 4) return (i + 1) * 4;
+    for (let i = 0; i < 6; i++) if (false) return (i + 1) * 4;
     return 0;
   }

[Timeout] EqualityOperator
src/Yatzy.ts:103:21
     tallies[d3 - 1]++;
     tallies[d4 - 1]++;
     tallies[d5 - 1]++;
-    for (let i = 0; i < 6; i++) if (tallies[i] >= 4) return (i + 1) * 4;
+    for (let i = 0; i <= 6; i++) if (tallies[i] >= 4) return (i + 1) * 4;
     return 0;
   }

[Timeout] BlockStatement
src/Yatzy.ts:107:94
     return 0;
   }
 
-  static three_of_a_kind(d1: number, d2: number, d3: number, d4: number, d5: number): number {
-    var t;
-    t = [0, 0, 0, 0, 0, 0, 0, 0, 0];
-    t[d1 - 1]++;
-    t[d2 - 1]++;
-    t[d3 - 1]++;
-    t[d4 - 1]++;
-    t[d5 - 1]++;
-    for (let i = 0; i < 6; i++) if (t[i] >= 3) return (i + 1) * 3;
-    return 0;
-  }
+  static three_of_a_kind(d1: number, d2: number, d3: number, d4: number, d5: number): number {}
 
   static smallStraight(d1: number, d2: number, d3: number, d4: number, d5: number): number {

[Timeout] ArrayDeclaration
src/Yatzy.ts:109:9
 
   static three_of_a_kind(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var t;
-    t = [0, 0, 0, 0, 0, 0, 0, 0, 0];
+    t = [];
     t[d1 - 1]++;
     t[d2 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:110:5
   static three_of_a_kind(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var t;
     t = [0, 0, 0, 0, 0, 0, 0, 0, 0];
-    t[d1 - 1]++;
+    t[d1 - 1]--;
     t[d2 - 1]++;
     t[d3 - 1]++;

[Timeout] ArithmeticOperator
src/Yatzy.ts:110:7
   static three_of_a_kind(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var t;
     t = [0, 0, 0, 0, 0, 0, 0, 0, 0];
-    t[d1 - 1]++;
+    t[d1 + 1]++;
     t[d2 - 1]++;
     t[d3 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:111:5
     var t;
     t = [0, 0, 0, 0, 0, 0, 0, 0, 0];
     t[d1 - 1]++;
-    t[d2 - 1]++;
+    t[d2 - 1]--;
     t[d3 - 1]++;
     t[d4 - 1]++;

[Timeout] ArithmeticOperator
src/Yatzy.ts:111:7
     var t;
     t = [0, 0, 0, 0, 0, 0, 0, 0, 0];
     t[d1 - 1]++;
-    t[d2 - 1]++;
+    t[d2 + 1]++;
     t[d3 - 1]++;
     t[d4 - 1]++;

[Timeout] ArithmeticOperator
src/Yatzy.ts:112:7
     t = [0, 0, 0, 0, 0, 0, 0, 0, 0];
     t[d1 - 1]++;
     t[d2 - 1]++;
-    t[d3 - 1]++;
+    t[d3 + 1]++;
     t[d4 - 1]++;
     t[d5 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:112:5
     t = [0, 0, 0, 0, 0, 0, 0, 0, 0];
     t[d1 - 1]++;
     t[d2 - 1]++;
-    t[d3 - 1]++;
+    t[d3 - 1]--;
     t[d4 - 1]++;
     t[d5 - 1]++;

[Timeout] UpdateOperator
src/Yatzy.ts:113:5
     t[d1 - 1]++;
     t[d2 - 1]++;
     t[d3 - 1]++;
-    t[d4 - 1]++;
+    t[d4 - 1]--;
     t[d5 - 1]++;
     for (let i = 0; i < 6; i++) if (t[i] >= 3) return (i + 1) * 3;

[Timeout] ArithmeticOperator
src/Yatzy.ts:113:7
     t[d1 - 1]++;
     t[d2 - 1]++;
     t[d3 - 1]++;
-    t[d4 - 1]++;
+    t[d4 + 1]++;
     t[d5 - 1]++;
     for (let i = 0; i < 6; i++) if (t[i] >= 3) return (i + 1) * 3;

[Timeout] ArithmeticOperator
src/Yatzy.ts:114:7
     t[d2 - 1]++;
     t[d3 - 1]++;
     t[d4 - 1]++;
-    t[d5 - 1]++;
+    t[d5 + 1]++;
     for (let i = 0; i < 6; i++) if (t[i] >= 3) return (i + 1) * 3;
     return 0;

[Timeout] UpdateOperator
src/Yatzy.ts:114:5
     t[d2 - 1]++;
     t[d3 - 1]++;
     t[d4 - 1]++;
-    t[d5 - 1]++;
+    t[d5 - 1]--;
     for (let i = 0; i < 6; i++) if (t[i] >= 3) return (i + 1) * 3;
     return 0;

[Timeout] ConditionalExpression
src/Yatzy.ts:115:21
     t[d3 - 1]++;
     t[d4 - 1]++;
     t[d5 - 1]++;
-    for (let i = 0; i < 6; i++) if (t[i] >= 3) return (i + 1) * 3;
+    for (let i = 0; false; i++) if (t[i] >= 3) return (i + 1) * 3;
     return 0;
   }

[Timeout] ArithmeticOperator
src/Yatzy.ts:115:56
     t[d3 - 1]++;
     t[d4 - 1]++;
     t[d5 - 1]++;
-    for (let i = 0; i < 6; i++) if (t[i] >= 3) return (i + 1) * 3;
+    for (let i = 0; i < 6; i++) if (t[i] >= 3) return (i - 1) * 3;
     return 0;
   }

[Timeout] BlockStatement
src/Yatzy.ts:119:92
     return 0;
   }
 
-  static smallStraight(d1: number, d2: number, d3: number, d4: number, d5: number): number {
-    var tallies;
-    tallies = [0, 0, 0, 0, 0, 0, 0];
-    tallies[d1 - 1] += 1;
-    tallies[d2 - 1] += 1;
-    tallies[d3 - 1] += 1;
-    tallies[d4 - 1] += 1;
-    tallies[d5 - 1] += 1;
-    if (tallies[0] == 1 && tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && tallies[4] == 1) return 15;
-    return 0;
-  }
+  static smallStraight(d1: number, d2: number, d3: number, d4: number, d5: number): number {}
 
   static largeStraight(d1: number, d2: number, d3: number, d4: number, d5: number): number {

[Timeout] AssignmentOperator
src/Yatzy.ts:122:5
   static smallStraight(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var tallies;
     tallies = [0, 0, 0, 0, 0, 0, 0];
-    tallies[d1 - 1] += 1;
+    tallies[d1 - 1] -= 1;
     tallies[d2 - 1] += 1;
     tallies[d3 - 1] += 1;

[Timeout] ArithmeticOperator
src/Yatzy.ts:122:13
   static smallStraight(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var tallies;
     tallies = [0, 0, 0, 0, 0, 0, 0];
-    tallies[d1 - 1] += 1;
+    tallies[d1 + 1] += 1;
     tallies[d2 - 1] += 1;
     tallies[d3 - 1] += 1;

[Timeout] AssignmentOperator
src/Yatzy.ts:123:5
     var tallies;
     tallies = [0, 0, 0, 0, 0, 0, 0];
     tallies[d1 - 1] += 1;
-    tallies[d2 - 1] += 1;
+    tallies[d2 - 1] -= 1;
     tallies[d3 - 1] += 1;
     tallies[d4 - 1] += 1;

[Timeout] ArithmeticOperator
src/Yatzy.ts:123:13
     var tallies;
     tallies = [0, 0, 0, 0, 0, 0, 0];
     tallies[d1 - 1] += 1;
-    tallies[d2 - 1] += 1;
+    tallies[d2 + 1] += 1;
     tallies[d3 - 1] += 1;
     tallies[d4 - 1] += 1;

[Timeout] ArithmeticOperator
src/Yatzy.ts:124:13
     tallies = [0, 0, 0, 0, 0, 0, 0];
     tallies[d1 - 1] += 1;
     tallies[d2 - 1] += 1;
-    tallies[d3 - 1] += 1;
+    tallies[d3 + 1] += 1;
     tallies[d4 - 1] += 1;
     tallies[d5 - 1] += 1;

[Timeout] AssignmentOperator
src/Yatzy.ts:124:5
     tallies = [0, 0, 0, 0, 0, 0, 0];
     tallies[d1 - 1] += 1;
     tallies[d2 - 1] += 1;
-    tallies[d3 - 1] += 1;
+    tallies[d3 - 1] -= 1;
     tallies[d4 - 1] += 1;
     tallies[d5 - 1] += 1;

[Timeout] ArithmeticOperator
src/Yatzy.ts:125:13
     tallies[d1 - 1] += 1;
     tallies[d2 - 1] += 1;
     tallies[d3 - 1] += 1;
-    tallies[d4 - 1] += 1;
+    tallies[d4 + 1] += 1;
     tallies[d5 - 1] += 1;
     if (tallies[0] == 1 && tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && tallies[4] == 1) return 15;

[Timeout] AssignmentOperator
src/Yatzy.ts:125:5
     tallies[d1 - 1] += 1;
     tallies[d2 - 1] += 1;
     tallies[d3 - 1] += 1;
-    tallies[d4 - 1] += 1;
+    tallies[d4 - 1] -= 1;
     tallies[d5 - 1] += 1;
     if (tallies[0] == 1 && tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && tallies[4] == 1) return 15;

[Timeout] AssignmentOperator
src/Yatzy.ts:126:5
     tallies[d2 - 1] += 1;
     tallies[d3 - 1] += 1;
     tallies[d4 - 1] += 1;
-    tallies[d5 - 1] += 1;
+    tallies[d5 - 1] -= 1;
     if (tallies[0] == 1 && tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && tallies[4] == 1) return 15;
     return 0;
