[Timeout] ArithmeticOperator
src/Yatzy.ts:126:13
     tallies[d2 - 1] += 1;
     tallies[d3 - 1] += 1;
     tallies[d4 - 1] += 1;
-    tallies[d5 - 1] += 1;
+    tallies[d5 + 1] += 1;
     if (tallies[0] == 1 && tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && tallies[4] == 1) return 15;
     return 0;

[Timeout] ConditionalExpression
src/Yatzy.ts:127:9
     tallies[d3 - 1] += 1;
     tallies[d4 - 1] += 1;
     tallies[d5 - 1] += 1;
-    if (tallies[0] == 1 && tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && tallies[4] == 1) return 15;
+    if (false) return 15;
     return 0;
   }

[Timeout] ConditionalExpression
src/Yatzy.ts:127:66
     tallies[d3 - 1] += 1;
     tallies[d4 - 1] += 1;
     tallies[d5 - 1] += 1;
-    if (tallies[0] == 1 && tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && tallies[4] == 1) return 15;
+    if (tallies[0] == 1 && tallies[1] == 1 && tallies[2] == 1 && true && tallies[4] == 1) return 15;
     return 0;
   }

[Timeout] BlockStatement
src/Yatzy.ts:131:92
     return 0;
   }
 
-  static largeStraight(d1: number, d2: number, d3: number, d4: number, d5: number): number {
-    var tallies;
-    tallies = [0, 0, 0, 0, 0, 0, 0, 0];
-    tallies[d1 - 1] += 1;
-    tallies[d2 - 1] += 1;
-    tallies[d3 - 1] += 1;
-    tallies[d4 - 1] += 1;
-    tallies[d5 - 1] += 1;
-    if (tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && tallies[4] == 1 && tallies[5] == 1) return 20;
-    return 0;
-  }
+  static largeStraight(d1: number, d2: number, d3: number, d4: number, d5: number): number {}
 
   static fullHouse(d1: number, d2: number, d3: number, d4: number, d5: number): number {

[Timeout] ArithmeticOperator
src/Yatzy.ts:134:13
   static largeStraight(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var tallies;
     tallies = [0, 0, 0, 0, 0, 0, 0, 0];
-    tallies[d1 - 1] += 1;
+    tallies[d1 + 1] += 1;
     tallies[d2 - 1] += 1;
     tallies[d3 - 1] += 1;

[Timeout] AssignmentOperator
src/Yatzy.ts:134:5
   static largeStraight(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var tallies;
     tallies = [0, 0, 0, 0, 0, 0, 0, 0];
-    tallies[d1 - 1] += 1;
+    tallies[d1 - 1] -= 1;
     tallies[d2 - 1] += 1;
     tallies[d3 - 1] += 1;

[Timeout] ConditionalExpression
src/Yatzy.ts:139:66
     tallies[d3 - 1] += 1;
     tallies[d4 - 1] += 1;
     tallies[d5 - 1] += 1;
-    if (tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && tallies[4] == 1 && tallies[5] == 1) return 20;
+    if (tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && true && tallies[5] == 1) return 20;
     return 0;
   }

[Timeout] ConditionalExpression
src/Yatzy.ts:139:47
     tallies[d3 - 1] += 1;
     tallies[d4 - 1] += 1;
     tallies[d5 - 1] += 1;
-    if (tallies[1] == 1 && tallies[2] == 1 && tallies[3] == 1 && tallies[4] == 1 && tallies[5] == 1) return 20;
+    if (tallies[1] == 1 && tallies[2] == 1 && true && tallies[4] == 1 && tallies[5] == 1) return 20;
     return 0;
   }

[Timeout] BooleanLiteral
src/Yatzy.ts:145:14
 
   static fullHouse(d1: number, d2: number, d3: number, d4: number, d5: number): number {
     var tallies;
-    var _2 = false;
+    var _2 = true;
     var i;
     var _2_at = 0;

[Timeout] BooleanLiteral
src/Yatzy.ts:148:14
     var _2 = false;
     var i;
     var _2_at = 0;
-    var _3 = false;
+    var _3 = true;
     var _3_at = 0;
 

[Timeout] ConditionalExpression
src/Yatzy.ts:158:17
     tallies[d4 - 1] += 1;
     tallies[d5 - 1] += 1;
 
-    for (i = 0; i != 6; i += 1)
+    for (i = 0; false; i += 1)
       if (tallies[i] == 2) {
         _2 = true;

[Timeout] AssignmentOperator
src/Yatzy.ts:158:25
     tallies[d4 - 1] += 1;
     tallies[d5 - 1] += 1;
 
-    for (i = 0; i != 6; i += 1)
+    for (i = 0; i != 6; i -= 1)
       if (tallies[i] == 2) {
         _2 = true;

[Timeout] BlockStatement
src/Yatzy.ts:159:28
     tallies[d5 - 1] += 1;
 
     for (i = 0; i != 6; i += 1)
-      if (tallies[i] == 2) {
-        _2 = true;
-        _2_at = i + 1;
-      }
+      if (tallies[i] == 2) {}
 
     for (i = 0; i != 6; i += 1)

[Timeout] ConditionalExpression
src/Yatzy.ts:159:11
     tallies[d5 - 1] += 1;
 
     for (i = 0; i != 6; i += 1)
-      if (tallies[i] == 2) {
+      if (true) {
         _2 = true;
         _2_at = i + 1;

[Timeout] BooleanLiteral
src/Yatzy.ts:160:14
 
     for (i = 0; i != 6; i += 1)
       if (tallies[i] == 2) {
-        _2 = true;
+        _2 = false;
         _2_at = i + 1;
       }

[Timeout] ArithmeticOperator
src/Yatzy.ts:161:17
     for (i = 0; i != 6; i += 1)
       if (tallies[i] == 2) {
         _2 = true;
-        _2_at = i + 1;
+        _2_at = i - 1;
       }
 

[Timeout] EqualityOperator
src/Yatzy.ts:164:17
         _2_at = i + 1;
       }
 
-    for (i = 0; i != 6; i += 1)
+    for (i = 0; i == 6; i += 1)
       if (tallies[i] == 3) {
         _3 = true;

[Timeout] BlockStatement
src/Yatzy.ts:165:28
       }
 
     for (i = 0; i != 6; i += 1)
-      if (tallies[i] == 3) {
-        _3 = true;
-        _3_at = i + 1;
-      }
+      if (tallies[i] == 3) {}
 
     if (_2 && _3) return _2_at * 2 + _3_at * 3;

[Timeout] ConditionalExpression
src/Yatzy.ts:165:11
       }
 
     for (i = 0; i != 6; i += 1)
-      if (tallies[i] == 3) {
+      if (true) {
         _3 = true;
         _3_at = i + 1;

[Timeout] BooleanLiteral
src/Yatzy.ts:166:14
 
     for (i = 0; i != 6; i += 1)
       if (tallies[i] == 3) {
-        _3 = true;
+        _3 = false;
         _3_at = i + 1;
       }

[Timeout] ArithmeticOperator
src/Yatzy.ts:167:17
     for (i = 0; i != 6; i += 1)
       if (tallies[i] == 3) {
         _3 = true;
-        _3_at = i + 1;
+        _3_at = i - 1;
       }
 

[Timeout] ArithmeticOperator
src/Yatzy.ts:170:26
         _3_at = i + 1;
       }
 
-    if (_2 && _3) return _2_at * 2 + _3_at * 3;
+    if (_2 && _3) return _2_at / 2 + _3_at * 3;
     else return 0;
   }

[Timeout] ArithmeticOperator
src/Yatzy.ts:170:38
         _3_at = i + 1;
       }
 
-    if (_2 && _3) return _2_at * 2 + _3_at * 3;
+    if (_2 && _3) return _2_at * 2 + _3_at / 3;
     else return 0;
   }

[Timeout] BlockStatement
src/Yatzy.ts:174:19
     else return 0;
   }
 
-  fours(): number {
-    var sum;
-    sum = 0;
-    for (let at = 0; at != 5; at++) {
-      if (this.dice[at] == 4) {
-        sum += 4;
-      }
-    }
-    return sum;
-  }
+  fours(): number {}
 
   fives(): number {

[Timeout] ConditionalExpression
src/Yatzy.ts:177:22
   fours(): number {
     var sum;
     sum = 0;
-    for (let at = 0; at != 5; at++) {
+    for (let at = 0; false; at++) {
       if (this.dice[at] == 4) {
         sum += 4;

[Timeout] BlockStatement
src/Yatzy.ts:177:37
   fours(): number {
     var sum;
     sum = 0;
-    for (let at = 0; at != 5; at++) {
-      if (this.dice[at] == 4) {
-        sum += 4;
-      }
-    }
+    for (let at = 0; at != 5; at++) {}
     return sum;
   }

[Timeout] ConditionalExpression
src/Yatzy.ts:178:11
     var sum;
     sum = 0;
     for (let at = 0; at != 5; at++) {
-      if (this.dice[at] == 4) {
+      if (true) {
         sum += 4;
       }

[Timeout] BlockStatement
src/Yatzy.ts:178:31
     var sum;
     sum = 0;
     for (let at = 0; at != 5; at++) {
-      if (this.dice[at] == 4) {
-        sum += 4;
-      }
+      if (this.dice[at] == 4) {}
     }
     return sum;

[Timeout] AssignmentOperator
src/Yatzy.ts:179:9
     sum = 0;
     for (let at = 0; at != 5; at++) {
       if (this.dice[at] == 4) {
-        sum += 4;
+        sum -= 4;
       }
     }

[Timeout] BlockStatement
src/Yatzy.ts:185:19
     return sum;
   }
 
-  fives(): number {
-    let s = 0;
-    var i;
-    for (i = 0; i < this.dice.length; i++) if (this.dice[i] == 5) s = s + 5;
-    return s;
-  }
+  fives(): number {}
 
   sixes(): number {

[Timeout] ConditionalExpression
src/Yatzy.ts:188:48
   fives(): number {
     let s = 0;
     var i;
-    for (i = 0; i < this.dice.length; i++) if (this.dice[i] == 5) s = s + 5;
+    for (i = 0; i < this.dice.length; i++) if (true) s = s + 5;
     return s;
   }

[Timeout] EqualityOperator
src/Yatzy.ts:188:48
   fives(): number {
     let s = 0;
     var i;
-    for (i = 0; i < this.dice.length; i++) if (this.dice[i] == 5) s = s + 5;
+    for (i = 0; i < this.dice.length; i++) if (this.dice[i] != 5) s = s + 5;
     return s;
   }

[Timeout] BlockStatement
src/Yatzy.ts:192:19
     return s;
   }
 
-  sixes(): number {
-    let sum = 0;
-    for (var at = 0; at < this.dice.length; at++) if (this.dice[at] == 6) sum = sum + 6;
-    return sum;
-  }
+  sixes(): number {}
 }
 

[Timeout] EqualityOperator
src/Yatzy.ts:194:55
 
   sixes(): number {
     let sum = 0;
-    for (var at = 0; at < this.dice.length; at++) if (this.dice[at] == 6) sum = sum + 6;
+    for (var at = 0; at < this.dice.length; at++) if (this.dice[at] != 6) sum = sum + 6;
     return sum;
   }

[Timeout] ArithmeticOperator
src/Yatzy.ts:194:81
 
   sixes(): number {
     let sum = 0;
-    for (var at = 0; at < this.dice.length; at++) if (this.dice[at] == 6) sum = sum + 6;
+    for (var at = 0; at < this.dice.length; at++) if (this.dice[at] == 6) sum = sum - 6;
     return sum;
   }
